#include <stdio.h>
#include <math.h>

int main()
{
    int a[3][4];
    int i, j, f=0, f1=0;  //задание переменных
    
    for (i=0;i<3;i++) {
        for (j=0;j<4;j++) {
            printf("Введите элемент [%d,%d]\n", i+1, j+1);  //ввод элементов матрицы
            scanf("%d",&a[i][j]);
        }
    }

    for (i=0;i<3;i++) {
        for (j=0;j<4;j++)
        printf(" %d", a[i][j]);  //вывод матрицы
        printf("\n");
    }
    
    for ( j=0; j<4; j++ ) {
        for ( i=0; i<3; i++ ) {
            if ( a[i][j]!=0 ) {
                f1 = 1;
            }
            else {
                f1 = 0;
                break;
            }           //поиск ненулевых элементов матрицы
        }
        if ( f1 == 1 ) {
            f++;    //подсчёт таких столбцов
        }
    }

    printf ("Количество стобцов матрицы не содержащих нули равно %i ", f);

    return 0;  //выполнил Романович Антон МС-12
}